Masmiseim36/nxpSDK/devices/MIMXRT1173/drivers/fsl_caam.c
    /* adding new job to the s_inJobRing[] must be atomic
     * as this is global variable
     */
    uint32_t currPriMask = DisableGlobalIRQ();
    if (kCAAM_JobRing0 == jobRing)
    {
        s_jr0->inputJobRing[s_jrIndex0] = (uintptr_t)descaddr;
        s_jrIndex0++;
        if (s_jrIndex0 >= ARRAY_SIZE(s_jr0->inputJobRing))
        {
            s_jrIndex0 = 0;
        }
    }
    else if (kCAAM_JobRing1 == jobRing)
    {
        s_jr1->inputJobRing[s_jrIndex1] = (uintptr_t)descaddr;
        s_jrIndex1++;
        if (s_jrIndex1 >= ARRAY_SIZE(s_jr1->inputJobRing))
        {
            s_jrIndex1 = 0;
        }
    }
    else if (kCAAM_JobRing2 == jobRing)
    {
        s_jr2->inputJobRing[s_jrIndex2] = (uintptr_t)descaddr;
        s_jrIndex2++;
        if (s_jrIndex2 >= ARRAY_SIZE(s_jr2->inputJobRing))
        {
            s_jrIndex2 = 0;
        }
    }
    else if (kCAAM_JobRing3 == jobRing)
    {
        s_jr3->inputJobRing[s_jrIndex3] = (uintptr_t)descaddr;
        s_jrIndex3++;
        if (s_jrIndex3 >= ARRAY_SIZE(s_jr3->inputJobRing))
        {
            s_jrIndex3 = 0;
        }
    }
    else
    {
        EnableGlobalIRQ(currPriMask);
        return kStatus_InvalidArgument;
    }

    caam_input_ring_set_jobs_added(base, jobRing, 1);
    EnableGlobalIRQ(currPriMask);

#if defined(__DCACHE_PRESENT) && (__DCACHE_PRESENT == 1U)
    if (DCacheEnableFlag)
    {
        /* Enable D cache. */
        SCB_EnableDCache();
    }
#endif /* __DCACHE_PRESENT */
#if defined(FSL_FEATURE_LMEM_HAS_SYSTEMBUS_CACHE) && (FSL_FEATURE_LMEM_HAS_SYSTEMBUS_CACHE > 0U)
#if defined(FSL_FEATURE_HAS_L1CACHE) && (FSL_FEATURE_HAS_L1CACHE > 0U)
    L1CACHE_EnableSystemCache();
#endif /* FSL_FEATURE_LMEM_HAS_SYSTEMBUS_CACHE */
#endif /* FSL_FEATURE_HAS_L1CACHE */

    return kStatus_Success;
}

/* this function shall be only called inside CAAM driver critical section
 * because it accesses global variables.
 */
static status_t caam_out_job_ring_remove(CAAM_Type *base, caam_job_ring_t jobRing, int outIndex)
{
    if (kCAAM_JobRing0 == jobRing)
    {
        s_jr0->outputJobRing[outIndex++] = 0; /* clear descriptor address */
        s_jr0->outputJobRing[outIndex]   = 0; /* clear status */
    }
    else if (kCAAM_JobRing1 == jobRing)
    {
        s_jr1->outputJobRing[outIndex++] = 0; /* clear descriptor address */
        s_jr1->outputJobRing[outIndex]   = 0; /* clear status */
    }
    else if (kCAAM_JobRing2 == jobRing)
    {
        s_jr2->outputJobRing[outIndex++] = 0; /* clear descriptor address */
        s_jr2->outputJobRing[outIndex]   = 0; /* clear status */
    }
    else if (kCAAM_JobRing3 == jobRing)
    {
        s_jr3->outputJobRing[outIndex++] = 0; /* clear descriptor address */
        s_jr3->outputJobRing[outIndex]   = 0; /* clear status */
    }

    caam_output_ring_set_jobs_removed(base, jobRing, 1);
    return 0;
}

static status_t caam_out_job_ring_test_and_remove(
    CAAM_Type *base, caam_job_ring_t jobRing, void *descriptor, bool *wait, bool *found)
{
    uint32_t currPriMask = DisableGlobalIRQ();
    int i;
    status_t status;

    *found = false;
    *wait  = true;
    status = kStatus_Success;
    uint32_t *jr;
    int jrEntries;

    if (jobRing == kCAAM_JobRing0)
    {
        jr        = s_jr0->outputJobRing;
        jrEntries = ARRAY_SIZE(s_jr0->outputJobRing);
    }
    else if (jobRing == kCAAM_JobRing1)
    {
        jr        = s_jr1->outputJobRing;
        jrEntries = ARRAY_SIZE(s_jr1->outputJobRing);
    }
    else if (jobRing == kCAAM_JobRing2)
    {
        jr        = s_jr2->outputJobRing;
        jrEntries = ARRAY_SIZE(s_jr2->outputJobRing);
    }
    else if (jobRing == kCAAM_JobRing3)
    {
        jr        = s_jr3->outputJobRing;
        jrEntries = ARRAY_SIZE(s_jr3->outputJobRing);
    }
    else
    {
        return kStatus_InvalidArgument;
    }

    /* check if an interrupt or other thread consumed the result that we just saw */
    if (caam_output_ring_get_slots_full(base, jobRing))
    {
        /* check if our descriptor is in the output job ring
         * look from the beginning of the out job ring
         */
        i = 0;

        while ((!*found) && (i < jrEntries))
        {
            if (jr[i] == (uint32_t)descriptor)
            {
                *found = true;
                *wait  = false;
                /* check for error in status word */
                if (jr[i + 1])
                {
                    /* printf("Error 0x%lx\r\n", jr[i + 1]); */

                    /* for JMP/HALT commands with User specified status, return the user status, just to allow the
                     * software to test for user status termination status words */
                    /* This is used by PKHA PrimalityTest to report a candidate is believed not being prime */
                    if (0x30000000u == (jr[i + 1] & 0xff000000u))
                    {
                        status = jr[i + 1];
                    }
                    else
                    {
                        status = kStatus_Fail;
                    }
                }
                caam_out_job_ring_remove(base, jobRing, i);
            }
            else
            {
                /* try next result */
                i += 2u;
            }
        }
    }
    EnableGlobalIRQ(currPriMask);
    return status;
}

typedef union _caam_xcm_block_t
{
    uint32_t w[4]; /*!< CAAM context register is 16 bytes written as four 32-bit words */
    uint8_t b[16]; /*!< 16 octets block for CCM B0 and CTR0 and for GCM */
} caam_xcm_block_t;

static uint32_t swap_bytes(uint32_t in)
{
    return (((in & 0x000000ffu) << 24) | ((in & 0x0000ff00u) << 8) | ((in & 0x00ff0000u) >> 8) |
            ((in & 0xff000000u) >> 24));
}

/*!
 * @brief AES GCM check validity of input arguments.
 *
 * This function checks the validity of input arguments.
 *
 * @param base LTC peripheral base address.
 * @param src Source address (plaintext or ciphertext).
 * @param iv Initialization vector address.
 * @param aad Additional authenticated data address.
 * @param dst Destination address (plaintext or ciphertext).
 * @param inputSize Size of input (same size as output) data in bytes.
 * @param ivSize Size of Initialization vector in bytes.
 * @param aadSize Size of additional data in bytes.
 * @param tagSize Size of the GCM tag in bytes.
 */
static status_t caam_aes_gcm_check_input_args(CAAM_Type *base,
                                              const uint8_t *src,
                                              const uint8_t *iv,
                                              const uint8_t *aad,
                                              uint8_t *dst,
                                              size_t inputSize,
                                              size_t ivSize,
                                              size_t aadSize,
                                              size_t tagSize)
{
    if (!base)
    {
        return kStatus_InvalidArgument;
    }

