Masmiseim36/nxpSDK/devices/MIMXRT1173/drivers/fsl_caam.c
    /* tag can be NULL to skip tag processing */
    if ((ivSize && (!iv)) || (aadSize && (!aad)) || (inputSize && ((!src) || (!dst))))
    {
        return kStatus_InvalidArgument;
    }

    /* octet length of tag (tagSize) must be element of 4,8,12,13,14,15,16 */
    if (((tagSize > 16u) || (tagSize < 12u)) && (tagSize != 4u) && (tagSize != 8u))
    {
        return kStatus_InvalidArgument;
    }

    /* no IV AAD DATA makes no sense */
    if (0 == (inputSize + ivSize + aadSize))
    {
        return kStatus_InvalidArgument;
    }

    /* check length of input strings. This is more strict than the GCM specificaiton due to 32-bit architecture.
     * The API interface would work on 64-bit architecture as well, but as it has not been tested, let it limit to
     * 32-bits.
     */
    if (!((ivSize >= 1u) && (sizeof(size_t) <= 4u)))
    {
        return kStatus_InvalidArgument;
    }

    return kStatus_Success;
}

static const uint32_t templateAesGcm[] = {
    /* 00 */ 0xB0800000u, /* HEADER */
    /* 01 */ 0x02000000u, /* KEY */
    /* 02 */ 0x00000000u, /* place: key address */

    /* 03 */ 0x82100908u, /* OPERATION: AES GCM Decrypt Finalize */

    /* 04 */ 0x12830004u, /* LOAD Class 1 ICV Size Register by IMM data */
    /* 05 */ 0x00000000u, /* place: received ICV size */

    /* 06 */ 0x22210000u, /* FIFO LOAD IV (flush) */
    /* 07 */ 0x00000000u, /* place: IV address */

    /* 08 */ 0x22310000u, /* FIFO LOAD AAD (flush) */
    /* 09 */ 0x00000000u, /* place: AAD address */

    /* 10 */ 0x22130000u, /* FIFO LOAD message */
    /* 11 */ 0x00000000u, /* place: message address */

    /* 12 */ 0x60300000u, /* FIFO STORE Message */
    /* 13 */ 0x00000000u, /* place: destination address */

    /* 14 */ 0xA3001201u, /* JMP always to next command. Load/store checkpoint. Class 1 done checkpoint. */

    /* For encryption, write the computed and encrypted MAC to user buffer */
    /* For decryption, compare the computed tag with the received tag, CICV-only job. */
    /* 15 */ 0x10880004u, /* LOAD Immediate to Clear Written Register. */
    /* 16 */ 0x08000004u, /* value for Clear Written Register: C1D and C1DS bits are set */
    /* 17 */ 0x12820004u, /* LOAD Immediate to C1DS Register. */
    /* 18 */ 0x00000000u, /* zero data size */
    /* 19 */ 0x12830004u, /* LOAD Class 1 ICV Size Register by IMM data */
    /* 20 */ 0x00000000u, /* place: received ICV size */
    /* 21 */ 0x82100902u, /* OPERATION: AES GCM Decrypt Update ICV_TEST */
    /* 22 */ 0x223B0000u, /* FIFO LOAD ICV */
    /* 23 */ 0x00000000u, /* place: received ICV address */
};

status_t caam_aes_gcm_non_blocking(CAAM_Type *base,
                                   caam_handle_t *handle,
                                   caam_desc_aes_gcm_t descriptor,
                                   const uint8_t *input,
                                   uint8_t *output,
                                   size_t size,
                                   const uint8_t *iv,
                                   size_t ivSize,
                                   const uint8_t *aad,
                                   size_t aadSize,
                                   const uint8_t *key,
                                   size_t keySize,
                                   uint32_t tag,
                                   size_t tagSize,
                                   int encrypt)
{
    BUILD_ASSURE(sizeof(templateAesGcm) <= sizeof(caam_desc_aes_gcm_t), caam_desc_aes_gcm_t_size);
    status_t status;

    status = caam_aes_gcm_check_input_args(base, input, iv, aad, output, size, ivSize, aadSize, tagSize);
    if (status != kStatus_Success)
    {
        return status;
    }

    /* get template descriptor and it's size */
    uint32_t descriptorSize = ARRAY_SIZE(templateAesGcm);
    caam_memcpy(descriptor, templateAesGcm, sizeof(templateAesGcm));

    /* add descriptor size */
    descriptor[0] |= (descriptorSize & DESC_SIZE_MASK);

    /* key address and key size */
    descriptor[1] |= (keySize & DESC_KEY_SIZE_MASK);
    descriptor[2] = (uint32_t)key;

    /* Encrypt decrypt */
    if (encrypt)
    {
        descriptor[3] |= 1u; /* ENC */
    }

    /* ICV Size */
    descriptor[5] = tagSize;

    bool ivLast  = (aadSize == 0) && (size == 0);
    bool aadLast = (size == 0);

    /* IV address and size */
    descriptor[6] |= (ivSize & DESC_PAYLOAD_SIZE_MASK);
    descriptor[7] = (uint32_t)iv;
    if (ivLast)
    {
        descriptor[6] |= DESC_LC1_MASK; /* LC1 */
    }

    /* AAD address and size */
    descriptor[8] |= (aadSize & DESC_PAYLOAD_SIZE_MASK);
    descriptor[9] = (uint32_t)aad;
    if ((!ivLast) && aadLast)
    {
        descriptor[8] |= DESC_LC1_MASK; /* LC1 */
    }

    /* Message source address and size */
    descriptor[10] |= (size & DESC_PAYLOAD_SIZE_MASK);
    descriptor[11] = (uint32_t)input;

    /* Message destination address and size */
    descriptor[12] |= (size & DESC_PAYLOAD_SIZE_MASK);
    descriptor[13] = (uint32_t)output;

    if (tag)
    {
        if (!encrypt)
        {
            descriptor[20] = tagSize;
            descriptor[22] |= (tagSize & DESC_TAG_SIZE_MASK);
            descriptor[23] = (uint32_t)tag;
        }
        else
        {
            /* For encryption change the command to FIFO STORE, as tag data needs to be put into tag output */
            descriptor[14] = 0x52200000u | (tagSize & DESC_TAG_SIZE_MASK); /* STORE from Class 1 context to tag */
            descriptor[15] = (uint32_t)tag;                                /* place: tag address */
            ;
            descriptor[16] = DESC_HALT; /* always halt with status 0x0 (normal) */
        }
    }
    else
    {
        /* tag is NULL, skip tag processing */
        descriptor[14] = DESC_HALT; /* always halt with status 0x0 (normal) */
    }

    /* add operation specified by descriptor to CAAM Job Ring */
    return caam_in_job_ring_add(base, handle->jobRing, &descriptor[0]);
}

static status_t caam_aes_ccm_check_input_args(CAAM_Type *base,
                                              const uint8_t *src,
                                              const uint8_t *iv,
                                              const uint8_t *key,
                                              uint8_t *dst,
                                              size_t ivSize,
                                              size_t aadSize,
                                              size_t keySize,
                                              size_t tagSize)
{
    if (!base)
    {
        return kStatus_InvalidArgument;
    }

